[
    {
        "video_id": "csj_B01_P01",
        "block_id": "B01_HOOK",
        "shot_id": "P01",
        "core_flag": false,
        "mv_context": "REAL_CHAOS",
        "asset_id": null,
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Handheld",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "If your credit score is between 630 and 690 and you’re planning to finance a car soon, you should not walk into a dealership before you see this.",
        "descripcion_visual": "Realistic macro shot of a messy dining table: overdue credit card bills, red payment-due letters, a half-read auto finance contract, and a smartphone screen showing a nearly zero bank balance in red. Hard top-down light, long shadows, tense atmosphere.",
        "funcion_narrativa": "Connect emotionally with the concrete pain of overpaying and living on the edge before understanding how the bank’s system works.",
        "prompt_imagen": "Macro photography of a messy dining table covered with overdue credit card statements, red payment-due letters, a printed auto finance contract, and a smartphone screen showing a near-zero bank balance in red. Realistic lighting, desaturated colors except for the red amounts, shallow depth of field, financial stress atmosphere.",
        "prompt_video": "Handheld camera slowly hovering over the messy table, with slight natural shake, drifting across the red overdue stamps and the negative balance on the phone. Realistic motion, stable exposure, no glitch effects, documentary tone.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B01_P02",
        "block_id": "B01_HOOK",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "LAB_CREDITSYSTEM_TABLE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Person A buys a twenty-five-thousand-dollar car with a 650 score. Person B buys the exact same car with a 710 score. Same car. Same job. Same income.",
        "descripcion_visual": "Isometric view of the central credit system table in the Financial War Room. On the smoked-glass surface there are two identical matte black data modules labeled visually as Person A and Person B (no readable text), each with a single teal cable running towards a vertical risk structure in the background.",
        "funcion_narrativa": "Introduce the cold system that sees two almost identical people as two different routes only because of their score band.",
        "prompt_imagen": "Isometric 3D view of a dark institutional financial command table (LAB_CREDITSYSTEM_TABLE). Two identical matte black data modules represent Person A and Person B, each connected by a single glowing teal fiber-optic cable toward a vertical stack of risk-band blocks. Deep navy background, subtle blueprint grid, photorealistic, no on-screen text.",
        "prompt_video": "Cinematic slow Zoom In towards the center of the credit system table, moving closer to the two data modules and their teal cables while small status lights and data pulses move gently inside the system. Camera is stable and smooth, no frantic motion.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B01_P03",
        "block_id": "B01_HOOK",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_FLOATING",
        "asset_id": "CREDIT_STAIRCASE_SIDE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Up / Tilt Down",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Over five years, Person A pays about seven thousand dollars in interest. Person B pays under four thousand seven hundred. That’s roughly two thousand three hundred dollars gone — just because, the week the bank ran the numbers, they landed in a different score band.",
        "descripcion_visual": "Isometric glass staircase representing score bands seen from a side angle. Lower steps glow soft amber, higher steps glow soft green. On one amber step, a small glass panel shows a higher monthly payment and red total interest; on a higher green step, another panel shows a slightly lower payment and green total interest.",
        "funcion_narrativa": "Visualize that the system works in steps: one small score change can move you to a different price band with a totally different cost.",
        "prompt_imagen": "Isometric 3D glass staircase in a dark financial lab, lower steps glowing soft amber and higher steps glowing soft green. On an amber step, a glass panel shows a higher payment and a red-tinted total interest. On a green step above, another panel shows a lower payment and a green-tinted total interest. Deep navy background, subtle blueprint grid, photorealistic, clean composition.",
        "prompt_video": "Slow Tilt Up camera move starting from the lower amber steps, then rising to reveal the higher green steps and the two contrasting payment/interest panels. Teal data lines pulse gently along the staircase while everything stays readable.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B01_P04",
        "block_id": "B01_HOOK",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "ICON_CAR_LOAN",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Rack Focus",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "If you’re in that mid-range, the system might be overcharging you based on one single snapshot of your report. In this video we’re not talking about credit repair or loopholes. We’re going to walk through a legal, data-driven way to push yourself up one band right before a major application. There are three moves, and the third one is where most people blow it.",
        "descripcion_visual": "Isometric 3D shot of a neutral silver family car on a dark lab platform. In front of it, a glass pricing panel is split into two rows: the top row shows a higher payment and red total interest, the bottom row shows a slightly lower payment and green total interest. A single teal cable runs from the car into the panel and forks into the two possible price outcomes.",
        "funcion_narrativa": "Make it tangible that the same car carries two invisible price tags: the expensive one and the optimized one based on score band.",
        "prompt_imagen": "Photorealistic isometric 3D scene of a neutral silver family car (ICON_CAR_LOAN style) on a dark lab platform, in front of a glass pricing panel with two clean rows of numbers: top row showing a higher monthly payment and red total interest, bottom row showing a slightly lower payment and green total interest. A teal data cable connects the car to the panel and splits into two paths.",
        "prompt_video": "Rack Focus shot that starts with sharp focus on the car while the pricing panel is soft, then slowly shifts focus so the car becomes slightly blurred and the two rows of the pricing panel become crystal clear. The teal cable glows softly during the shift, no fast motion, documentary tone.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B02_P01",
        "block_id": "B02_INTRO",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_MAIN",
        "asset_id": "LAB_ISOMETRIC_MAIN",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Welcome to Hintsly Lab. We don’t promise magic; we run experiments with money and show you the math.",
        "descripcion_visual": "Wide isometric view of the full Financial War Room in dark institutional mode. Deep navy walls with a subtle blueprint grid, server racks and data screens along the sides, and a central smoked-glass table with a discreet Hintsly Lab mark glowing softly.",
        "funcion_narrativa": "Present Hintsly Lab as a serious data laboratory: not magic, but financial engineering.",
        "prompt_imagen": "Isometric 3D wide shot of a dark institutional financial war room (LAB_ISOMETRIC_MAIN). Deep navy walls with a subtle blueprint grid, server racks and data displays in the background, and a central smoked-glass table with a softly glowing abstract Hintsly Lab logo on its surface. Photorealistic, clean composition, no on-screen text.",
        "prompt_video": "Cinematic slow Zoom In towards the central smoked-glass table in the war room, keeping the camera stable while teal status lights on the servers blink gently in the background. Documentary-style motion, no flashy moves.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B02_P02",
        "block_id": "B02_INTRO",
        "shot_id": "P02",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "ICON_CARDBLACK_FRONT",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Static",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "In this test we’re asking one question: if you already have a decent score, can you rearrange your debt—without paying it all off forever—to jump a score band and make a loan cheaper?",
        "descripcion_visual": "Isometric shot of a lab platform where a US dollar bill and several matte black credit cards lie under a transparent crystal analysis module, like a futuristic microscope. Teal data cables enter and exit the module, suggesting the money is under examination.",
        "funcion_narrativa": "Reinforce visually that this is not about magic promises, but about putting money and credit under a lab microscope.",
        "prompt_imagen": "Isometric 3D shot of a dark lab table (ICON_CARDBLACK_FRONT style cards) where a US dollar bill and several matte black credit cards rest under a transparent crystal analysis module, like a futuristic microscope. Teal data cables enter and exit the module, deep navy background, institutional dark mode, photorealistic, no text.",
        "prompt_video": "Static camera shot with subtle internal motion only: soft teal scan-lines moving across the analysis module, tiny indicator lights pulsing, but no camera movement. Calm, controlled, documentary feel.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B02_P03",
        "block_id": "B02_INTRO",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_HUD",
        "asset_id": "CREDIT_DEBTFLOW_HUD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Quick reality check: this is education, not personal financial advice, and every lender has its own model. The numbers you’ll see are examples, not guarantees. What we can show you is how the algorithm tends to react to specific patterns on your report. If you’re good with that level of honesty, let’s take the score system apart.",
        "descripcion_visual": "Isometric view of a central glass cube representing a credit scoring algorithm, floating above a smoked-glass table. Around it, several transparent panels show abstract graphs and score fields, all linked by teal cables in a clean, ordered HUD-style layout.",
        "funcion_narrativa": "Introduce the idea that the protocol reveals how scoring algorithms tend to react to patterns, with full transparency and no guarantee.",
        "prompt_imagen": "Isometric 3D scene of a central glass cube representing a credit scoring algorithm (CREDIT_DEBTFLOW_HUD style), sitting just above a smoked-glass lab table. Several transparent data panels float around it, showing generic score graphs and fields with no readable text, all connected by glowing teal fiber-optic cables. Deep navy institutional background, subtle blueprint grid, photorealistic, tidy layout.",
        "prompt_video": "Slow, controlled Orbit around the central glass cube and its connected panels, keeping the movement smooth and documentary-like while teal cables pulse softly. The graphs stay stable and readable, no frantic animation.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B03_P01",
        "block_id": "B03_STAIRCASE",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_HUD",
        "asset_id": "CREDIT_SCOREGAUGE_HUD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Left",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Here’s the first big idea. Banks don’t really care if your score is 649 or 651. They care about the band you’re in.",
        "descripcion_visual": "Isometric HUD-style view of a large semicircular credit score gauge dial in the lab. Colored segments run from red to amber to green. The pointer sits exactly on the boundary between two middle segments. A small minimalist data avatar icon is connected to the dial by a thin teal cable.",
        "funcion_narrativa": "Set up the staircase idea: lenders care about which colored zone you occupy, not the tiny difference between two numbers.",
        "prompt_imagen": "Isometric 3D view of a credit score gauge dial in a dark institutional financial lab (CREDIT_SCOREGAUGE_HUD). Segments run from red to amber to green, with the pointer exactly on the boundary between two mid segments. A minimalist data avatar icon connects to the dial via a thin glowing teal cable. Deep navy background with subtle blueprint grid, photorealistic, no readable text.",
        "prompt_video": "Slow Truck Left camera move sliding across the dial from one side towards the pointer on the band boundary. The pointer stays still, teal cable glows softly, and the HUD elements remain crisp and legible.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B03_P02",
        "block_id": "B03_STAIRCASE",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_FLOATING",
        "asset_id": "CREDIT_STAIRCASE_MAIN",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Up / Tilt Down",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Think of it like a staircase: Poor, Fair, Good, Very Good, Excellent. Loan pricing is locked to the step, not the exact number.",
        "descripcion_visual": "Isometric glass staircase suspended in the Financial War Room, lower steps glowing amber, higher steps glowing green with a smooth gradient between them. A minimalist data avatar stands on a middle step. Thin teal cables run from each step down into the lab floor.",
        "funcion_narrativa": "Turn the metaphor into a clear image: the system is a staircase of bands, and what matters is which step you are standing on.",
        "prompt_imagen": "Isometric 3D glass staircase (CREDIT_STAIRCASE_MAIN) in a dark financial war room, lower steps glowing soft amber, higher steps glowing soft green with gradient steps in between. A minimalist data avatar stands on one of the middle steps. Each step is connected downwards by thin glowing teal cables into the lab floor. Deep navy background, subtle blueprint grid, photorealistic, no text.",
        "prompt_video": "Slow Tilt Up camera movement starting from the lower amber steps and rising toward the higher green steps, passing the step where the data avatar stands. Teal cables pulse gently while the staircase remains clear and readable.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B03_P03",
        "block_id": "B03_STAIRCASE",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_WALL",
        "asset_id": "LAB_WALL_COLUMNS_STATS",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "If you’re at the top of ‘Fair’ and jump into ‘Good’, you don’t just look slightly better – you drop into a different risk bucket. The computer doesn’t see ‘tiny improvement’. It sees: new category, new price.",
        "descripcion_visual": "From the staircase, two large glass risk columns appear against a stats wall: one glowing amber, one glowing green. The same data avatar appears twice: once wired from a high amber step into the amber column, and once from a higher green step into the green column via teal cables.",
        "funcion_narrativa": "Show that moving up a step sends you into a different risk bucket: the same person, two different price categories.",
        "prompt_imagen": "Isometric 3D scene showing the glass staircase in the foreground and two tall glass risk columns on the stats wall (LAB_WALL_COLUMNS_STATS): one glowing amber, one glowing green. The same minimalist data avatar appears twice: one instance connected via teal cable from a high amber step into the amber column, and another from a higher green step into the green column. Deep navy institutional background, photorealistic.",
        "prompt_video": "Slow, controlled Orbit around the staircase and the two risk columns, revealing how the same avatar connects into a different bucket when standing on a higher step. Camera remains smooth, teal cables pulse gently, no chaotic motion.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B03_P04",
        "block_id": "B03_STAIRCASE",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_STAIRCASE_TABLE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "The Clean Score Jump exists to nudge you up that single step at the moment it matters. Now let’s put real numbers on it.",
        "descripcion_visual": "Glass protocol module on a lab table next to the staircase base. One teal cable comes down from a high amber step into the module; another teal cable runs from the module up into a green step above. A data avatar stands near the green step, as if just moved.",
        "funcion_narrativa": "Introduce the Clean Score Jump as an engineered mechanism designed to push you one step up right when it matters.",
        "prompt_imagen": "Isometric 3D shot of a central glass protocol module (CREDIT_STAIRCASE_TABLE style) sitting next to the glass staircase base. A teal cable runs from a high amber step down into the module, and another teal cable runs from the module up into a green step above. A minimalist data avatar stands near the green step, suggesting the jump. Dark institutional background, photorealistic, no text.",
        "prompt_video": "Cinematic slow Zoom In toward the protocol module and its two teal cables, starting wider with the staircase visible, then tightening on the amber step → module → green step connection. Movement is smooth and controlled, emphasizing precision.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B04_P01",
        "block_id": "B04_BASELINE",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_REPORT_PANEL",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Static",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "This experiment works best if your score is between 630 and 690, you have credit cards with balances, and you plan to apply for a loan in about 60 days.",
        "descripcion_visual": "Isometric shot of a user profile console on a smoked-glass lab table. A glass tablet shows an abstract credit profile: a data avatar, a score band centered around 650, several card icons, and a small 60-day timeline highlighted.",
        "funcion_narrativa": "Define who this experiment is for: mid-range score, card balances, and a loan application window ahead.",
        "prompt_imagen": "Isometric 3D shot of a user credit profile panel (CREDIT_REPORT_PANEL style) on a smoked-glass table. The glass UI shows a minimalist data avatar, a score band centered around 650, several credit card icons, and a small timeline highlighting roughly 60 days. Deep navy background with subtle blueprint grid, photorealistic, no legible text.",
        "prompt_video": "Static camera shot where subtle teal scan-lines move across the glass profile panel, and the 60-day segment of the timeline pulses softly. No camera movement, only controlled internal UI motion.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B04_P02",
        "block_id": "B04_BASELINE",
        "shot_id": "P02",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_DEBTFLOW_HUD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Here’s our baseline: a twenty-five-thousand-dollar auto loan, 60 months, sitting in a Fair band around 650 with a rate of about ten percent.",
        "descripcion_visual": "Isometric view of a glass loan-configuration module on the table. Three clear controls represent loan amount, term, and rate: one dial around 25k, one marking 60 months, and one slider sitting near a 10% mark within the Fair band.",
        "funcion_narrativa": "Establish the numeric baseline: amount, term, band, and typical interest rate before any optimization.",
        "prompt_imagen": "Isometric 3D view of a loan setup HUD module (CREDIT_DEBTFLOW_HUD style) in the financial lab. Three distinct controls represent loan amount, term, and rate: one set to 25k, one highlighting 60 months, and one positioned near a 10% mark within a Fair band. Teal fiber-optic cables connect the module to the lab table. Dark navy institutional background, photorealistic, no readable text.",
        "prompt_video": "Cinematic slow Zoom In toward the loan configuration module as the three controls lock into their positions (25k, 60 months, mid-range rate). Teal cables glow softly while the camera moves in a controlled, documentary-style motion.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B04_P03",
        "block_id": "B04_BASELINE",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BEFORE_AFTER_RESULTS",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Down / Tilt Up",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "That works out to a payment near five hundred thirty dollars and roughly seven thousand in total interest. That’s the default price tag if you walk in as you are.",
        "descripcion_visual": "Isometric results panel on the same table summarizing the baseline loan. The top block shows the approximate monthly payment; the lower block highlights total interest around 7,000 dollars in soft red.",
        "funcion_narrativa": "Make the default price tag visible: what you pay if you walk into the bank exactly as you are today.",
        "prompt_imagen": "Isometric 3D scene of a glass results panel (CREDIT_BEFORE_AFTER_RESULTS style) on the lab table. The top section shows an approximate monthly payment block, and the lower section highlights a total interest figure around 7,000 dollars in a soft red accent. A single teal cable connects the panel into the system. Dark institutional background, photorealistic, no detailed text.",
        "prompt_video": "Slow Tilt Down camera move starting slightly above the results panel and settling on the total interest block, letting the red-highlighted interest area glow softly while the rest of the UI stays calm and readable.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B05_P01",
        "block_id": "B05_EXAM_MODE",
        "shot_id": "P01",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_EXAMMODE_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Rack Focus",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Move One is what credit nerds call AZEO: All Zero, Except One – putting your wallet in Exam Mode.",
        "descripcion_visual": "Isometric shot of an Exam Mode control module on the lab table. A large glass touch button is visually marked as an exam/test icon. A white technical glove hovers just above, about to press it.",
        "funcion_narrativa": "Introduce Exam Mode / AZEO as a mental switch: all cards to zero except one.",
        "prompt_imagen": "Isometric 3D shot of a dark institutional financial lab console (CREDIT_EXAMMODE_MODULE style). On a smoked-glass surface, a large glass touch button is visually labeled as Exam Mode with a simple icon, no readable text. A white technical glove finger is hovering just above the button, ready to press. Deep navy background, subtle blueprint grid, photorealistic.",
        "prompt_video": "Rack Focus shot that starts with the glove finger in sharp focus and the Exam Mode button soft, then slowly shifts focus so the glass button becomes crystal clear as the finger moves closer. Smooth, controlled motion, no flashy effects.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B05_P02",
        "block_id": "B05_EXAM_MODE",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_FIVECARDS_UTILIZATION",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Left",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Scoring models are obsessed with utilization: how much of your total credit you use, and how many cards are carrying a balance.",
        "descripcion_visual": "Isometric view of a credit utilization panel: five minimalist credit cards in a row on a crystal platform, each with a floating usage bar above it at different fill levels. A circular aggregate utilization gauge hovers nearby, partially filled.",
        "funcion_narrativa": "Show visually what utilization means: how much you use in total and how many cards are actually carrying balances.",
        "prompt_imagen": "Isometric 3D view of a credit utilization module (CREDIT_FIVECARDS_UTILIZATION) on a dark lab platform. Five minimalist credit cards lie in a row, each with a floating usage bar showing different fill levels. A circular aggregate utilization indicator hovers to the side, partially filled. Deep navy background, teal data accents, photorealistic, no readable text.",
        "prompt_video": "Smooth Truck Left camera move sliding across the row of cards and their usage bars, briefly revealing the aggregate utilization indicator. Bars and the circular gauge animate gently, but values remain stable and readable.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B05_P03",
        "block_id": "B05_EXAM_MODE",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_FIVECARDS_UTILIZATION",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Down / Tilt Up",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "For one to two billing cycles before you apply, the goal is simple: every credit card reports a zero balance, except one. That one card should show a tiny, intentional balance – think low single digits of the limit, about the price of a lunch, not a weekend trip.",
        "descripcion_visual": "Top-down isometric shot of the same five cards. Four cards are greyed out with zero usage; the center card glows soft teal with a small low-range utilization bar and a subtle icon hinting at a modest everyday purchase.",
        "funcion_narrativa": "Show the exact Exam Mode target: all cards at zero except one with a small, deliberate, controlled balance.",
        "prompt_imagen": "Isometric top-down 3D shot of five credit cards (CREDIT_FIVECARDS_UTILIZATION style) on a dark lab platform. Four cards are greyed out with no visible usage, while the center card glows soft teal with a small low-range utilization bar and a subtle icon suggesting a modest everyday purchase. Deep navy background, photorealistic, clean layout.",
        "prompt_video": "Slow Tilt Down movement starting from a slight angle and settling into a near top-down view, emphasizing the contrast between the four grey zero-balance cards and the single softly glowing card with a small usage bar.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B05_P04",
        "block_id": "B05_EXAM_MODE",
        "shot_id": "P04",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_EXAMMODE_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Why not just set everything to zero? Because in some older models, if every line reports zero, the system treats you like you’re not using credit at all and can shave a few points off. Exam Mode doesn’t fix late payments or collections, but it cleans the surface so the next moves have a real shot at pushing you up a band.",
        "descripcion_visual": "Split-panel view within the lab. On the left, all cards are fully greyed out with a small red penalty indicator near the algorithm core. On the right, the AZEO pattern appears: four grey cards, one teal card with a tiny balance, and a neutral or slightly positive indicator.",
        "funcion_narrativa": "Explain why going to all zeros can backfire, and why AZEO is the cleaner exam state for the next moves.",
        "prompt_imagen": "Isometric 3D split-panel scene in a dark financial lab. On the left, a group of fully greyed-out cards with a small red penalty indicator near the CREDIT_EXAMMODE_MODULE core. On the right, the AZEO pattern: four grey cards and one softly glowing teal card with a tiny balance, next to a neutral or slightly positive indicator. Both sides connect into the same central glass algorithm module via teal cables. Photorealistic, institutional dark mode.",
        "prompt_video": "Slow, controlled Orbit that starts centered on the algorithm core and reveals both states: the all-zero cards with a red penalty indicator and the AZEO pattern with a neutral/positive indicator. Camera stays smooth, emphasizing the contrast without chaos.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B06_P01",
        "block_id": "B06_BORROWING_HISTORY",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BORROWHISTORY_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Right",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Move Two is situational, and it requires extreme trust. It’s about becoming an authorized user on someone else’s very clean credit card – a parent, partner, sibling, or mentor.",
        "descripcion_visual": "Isometric view of two glass platforms in the lab. On the left, a golden data avatar (mentor) stands next to a glowing older credit card; on the right, a blue data avatar (user) stands by a smaller credit file module. A single teal cable bridges from the golden card to the blue file.",
        "funcion_narrativa": "Introduce the high-trust idea of becoming an authorized user: connecting someone else’s clean card history to your own file.",
        "prompt_imagen": "Isometric 3D view of a dark institutional financial lab (CREDIT_BORROWHISTORY_MODULE style). On the left platform stands a golden data avatar next to a glowing, older credit card. On the right platform stands a blue data avatar next to a smaller credit file module. A single glowing teal fiber-optic cable runs from the golden card to the blue file, forming a clean bridge between them. Deep navy background, photorealistic, no text.",
        "prompt_video": "Smooth Truck Right camera move following the teal cable from the golden mentor platform over to the blue user file, emphasizing the connection between them. Motion is controlled and documentary-style, no frantic movement.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B06_P02",
        "block_id": "B06_BORROWING_HISTORY",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BORROWHISTORY_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "We’re looking for a card that is old, has a solid limit, and has zero late payments. When they add you, you don’t need to spend their money. In many scoring models, that authorized user line can pull some of that positive history into your file: more total available credit, a longer average age of accounts, and one more line with perfect behavior.",
        "descripcion_visual": "Closer isometric shot of the user’s credit file module on the table. Several rows of glass blocks represent existing lines; a new row lights up softly as the teal cable from the mentor plugs in. Icons around the file hint at more total available credit, longer average age, and one more perfect line.",
        "funcion_narrativa": "Show how the authorized-user line can pull in positive history: more total credit, more age, and another clean trade line.",
        "prompt_imagen": "Isometric 3D shot of the user’s credit file (CREDIT_BORROWHISTORY_MODULE) on a smoked-glass table. Several transparent rows represent existing credit lines; a new row of glass blocks lights up softly as a teal cable from the mentor side plugs into it. Around the module, subtle icons suggest increased total available credit, longer average age, and one more perfect-behavior line. Dark navy background, photorealistic.",
        "prompt_video": "Cinematic slow Zoom In toward the credit file as the new authorized-user row fades in and glows softly while the teal cable locks into place. Supporting icons highlight briefly in a controlled, readable way.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B06_P03",
        "block_id": "B06_BORROWING_HISTORY",
        "shot_id": "P03",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BORROWHISTORY_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Handheld",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "But this is not free magic. If they miss a payment, you get hurt. If they max out the card, you get hurt. Some lenders also discount authorized-user lines if it looks like you’re just renting someone else’s history.",
        "descripcion_visual": "Same mentor–user connection, but now sections of the teal cable flicker red. Above the mentor’s card, a utilization gauge spikes into a high zone; near the user’s file, small red warning icons appear.",
        "funcion_narrativa": "Make the risk visible: if the mentor slips up, the damage flows straight into the user’s file.",
        "prompt_imagen": "Isometric 3D scene of the same golden mentor platform and blue user platform (CREDIT_BORROWHISTORY_MODULE), connected by a teal cable whose segments now flicker red. Above the mentor’s card, a utilization gauge spikes into the high zone. Small red warning icons appear near the user’s credit file module. Dark institutional war room setting, photorealistic.",
        "prompt_video": "Subtle Handheld-style camera movement circling slightly around the connection as sections of the cable flicker red and warning icons appear. Motion is gentle but less stable, reinforcing a sense of shared risk without chaos.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B06_P04",
        "block_id": "B06_BORROWING_HISTORY",
        "shot_id": "P04",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "AVATAR_MENTOR_GOLD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "This is a high-trust maneuver, not a requirement. Only use it if the relationship is real and strong and both of you understand the risk. Done right, you’re not just cleaning today’s picture – you’re borrowing a bit of someone else’s long, boring, perfect history.",
        "descripcion_visual": "Calm isometric shot of a shared glass platform. A golden data avatar and a blue data avatar stand side by side, with a long timeline of perfect green payment markers stretching behind them. A single stable teal cable links their shared credit system.",
        "funcion_narrativa": "Close the block by framing this as an optional high-trust tool that works best when the relationship and history are genuinely strong.",
        "prompt_imagen": "Isometric 3D shot (AVATAR_MENTOR_GOLD style) of a shared glass platform in the financial war room. A golden data avatar and a blue data avatar stand side by side. Behind them stretches a long timeline of green checkmarks or perfect payment markers, glowing softly. A single stable teal cable links their shared credit system. Deep navy background, photorealistic, calm atmosphere.",
        "prompt_video": "Slow, controlled Orbit around the shared platform, revealing the long streak of perfect-history markers and the stable teal cable between the two avatars. Motion feels calm and authoritative, emphasizing trust and boring, perfect behavior.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B07_P01",
        "block_id": "B07_SNAPSHOT",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_WALL",
        "asset_id": "CREDIT_SNAPSHOT_CAMERA",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Move Three is timing. Your score doesn’t update when you send the payment. It updates when the bank takes the snapshot.",
        "descripcion_visual": "Extreme close-up isometric shot of a futuristic surveillance camera lens embedded in the Financial War Room wall. The glass iris glows softly amber while thin teal data cables feed into the back of the device.",
        "funcion_narrativa": "Present the central idea: your score moves when the system takes the photo, not when you send the payment.",
        "prompt_imagen": "Extreme close-up isometric 3D shot of a futuristic surveillance camera lens (CREDIT_SNAPSHOT_CAMERA) embedded in a dark institutional financial war room wall. The glass iris glows softly in amber, with thin teal data cables feeding into the back. Deep navy background, brushed metal and smoked glass materials, photorealistic.",
        "prompt_video": "Cinematic slow Zoom In toward the camera lens as the mechanical iris gently opens and closes in a breathing motion with a soft amber glow. Teal cables pulse subtly while the rest of the scene stays stable and controlled.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B07_P02",
        "block_id": "B07_SNAPSHOT",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_TIMELINE_SNAPSHOT",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Left",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "That snapshot usually happens on the statement closing date, which is not the same as your due date. The due date is when you pay to avoid a fee. The statement date is when the bank freezes your balance and sends that number to the bureaus.",
        "descripcion_visual": "Top-down isometric view of a holographic timeline on a lab table. Two vertical markers stand out: one for the statement date, one for the due date. A glowing balance block travels along the track, with thin teal lines connecting the elements.",
        "funcion_narrativa": "Explain that the snapshot usually happens at statement closing, not at the payment due date.",
        "prompt_imagen": "Isometric top-down 3D view of a holographic credit timeline (CREDIT_TIMELINE_SNAPSHOT) on a smoked-glass lab table. Two distinct vertical markers stand on the track: one representing the statement-date, one representing the due-date. A glowing balance block travels along the track, with thin teal lines connecting the elements into the system. Dark navy background, photorealistic, no readable text.",
        "prompt_video": "Smooth Truck Left camera move sliding along the holographic timeline as the glowing balance block passes the statement-date marker first and continues toward the due-date marker. Motion is controlled and readable, with subtle teal pulses along the track.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B07_P03",
        "block_id": "B07_SNAPSHOT",
        "shot_id": "P03",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_TIMELINE_SNAPSHOT",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Handheld",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Here’s the classic trap: your due date is the 30th, your statement date was the 27th, and you pay on the 29th. You were on time for the bank, but too late for the camera. The snapshot already captured the high balance.",
        "descripcion_visual": "Same timeline, now with explicit markers on day 27 and day 30. A balance block sits just before the 27 marker while a camera icon above 27 emits a soft flash. A separate marker indicates a payment closer to day 29, after the snapshot.",
        "funcion_narrativa": "Show the classic trap: you can pay before the due date and still be too late for the snapshot.",
        "prompt_imagen": "Isometric 3D scene using the CREDIT_TIMELINE_SNAPSHOT asset, labeled abstractly with day-27 and day-30 markers. A balance block sits just before the 27 marker while a small camera icon above 27 emits a soft white flash. A separate payment marker appears closer to day 29. The captured balance block glows in a soft red tint. Dark institutional lab setting, photorealistic, no readable numbers.",
        "prompt_video": "Gentle Handheld-style camera movement over the timeline as the camera icon flashes briefly at the statement-date marker and the balance block freezes in a soft red glow, while a later payment marker appears further down the track. Motion is subtle but slightly less stable to emphasize the mistake.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B07_P04",
        "block_id": "B07_SNAPSHOT",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_REPORT_PANEL",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Down / Tilt Up",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "So the protocol is simple: find the statement date for each card, pay your cards down to zero—or that tiny Exam Mode balance on the one card you keep active—a few days before the statement date, not just before the due date. When the camera flashes, your report shows almost all cards at zero, one small controlled balance, and, if you used it, that long, clean authorized-user line. This move often decides whether your Clean Score Jump becomes a real band change or just a nice idea.",
        "descripcion_visual": "Isometric shot of a credit report panel on the lab table. Several rows represent credit cards: most rows show green zero indicators, one row shows a small controlled teal balance, and one additional row represents a long clean authorized-user line. Above, the same camera lens points down at the panel.",
        "funcion_narrativa": "Show the ideal photo: almost everything at zero, one small controlled balance, and, if used, a long, clean authorized-user line captured at the right moment.",
        "prompt_imagen": "Isometric 3D shot of a credit report panel (CREDIT_REPORT_PANEL) on a smoked-glass lab table. Several rows represent cards: most show green zero-balance indicators, one row shows a small controlled teal balance, and an additional row represents a long clean authorized-user line. Above, the CREDIT_SNAPSHOT_CAMERA lens points down at the panel. Dark navy background, photorealistic, clean layout, no readable text.",
        "prompt_video": "Slow Tilt Down from the camera lens toward the credit report panel as a brief white flash occurs, leaving the panel clearly visible with mostly zero balances, one small teal balance, and a clean authorized-user row. Motion is smooth and documentary, emphasizing engineered timing.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B08_P01",
        "block_id": "B08_RESULT",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_HUD",
        "asset_id": "CREDIT_SCOREGAUGE_HUD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Now let’s rerun the numbers with the protocol in place. In real-world cases, that combo has pushed people from the mid-600s into the low 700s, crossing from a Fair band into a Good one. It doesn’t happen for everyone, but it shows the scale of what’s possible.",
        "descripcion_visual": "HUD-style credit band display: on one side, a marker glows in the middle of the Fair zone around the mid-600s; on the other, the same marker appears in the Good zone near the low 700s. Three small glass modules labeled visually as Move 1, Move 2, Move 3 feed teal cables into the band system.",
        "funcion_narrativa": "Recap the jump: combining the three moves can push some people from Fair into Good, changing the band and the price.",
        "prompt_imagen": "Isometric 3D view of a credit band HUD (CREDIT_SCOREGAUGE_HUD) in a dark institutional war room. On one side, a glowing marker sits in the middle of a Fair band around the mid-600s; on the other side, the same marker appears in a Good band near the low 700s. Three small glass modules visually representing Move 1, Move 2, and Move 3 feed glowing teal cables into the band system. Deep navy background, photorealistic, clean composition.",
        "prompt_video": "Slow, controlled Orbit around the band module, starting near the Fair marker and revealing the Good marker as the camera moves, while the three Move modules pulse softly in teal to show their contribution. Everything remains stable and legible.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B08_P02",
        "block_id": "B08_RESULT",
        "shot_id": "P02",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BEFORE_AFTER_RESULTS",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Down / Tilt Up",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Back to our example borrower. Before the Clean Score Jump: rate around ten percent, payment about five hundred thirty dollars, total interest roughly seven thousand.",
        "descripcion_visual": "Isometric comparative panel on a smoked-glass table with two columns. The BEFORE column is active: a rate near 10%, a monthly payment around 530, and a total interest near 7,000 highlighted in soft red. The AFTER column is present but dimmed.",
        "funcion_narrativa": "Review the example borrower’s baseline numbers before the Clean Score Jump.",
        "prompt_imagen": "Isometric 3D split-panel results display (CREDIT_BEFORE_AFTER_RESULTS) on a smoked-glass lab table. The left column for BEFORE shows a rate block near 10%, a payment block around 530, and a total interest block around 7,000 with a soft red accent. The right column for AFTER exists but is dimmed and inactive. Dark institutional background, photorealistic, no sharp text.",
        "prompt_video": "Slow Tilt Down camera movement focusing first on the BEFORE side: the 10% rate, ~530 payment, and ~7,000 interest blocks glow softly, especially the red-tinted interest block, while the AFTER side remains dim.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B08_P03",
        "block_id": "B08_RESULT",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_BEFORE_AFTER_RESULTS",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Right",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "After a successful jump into a better band, a lender might offer something closer to seven percent instead of ten, with a payment around four hundred ninety-five dollars and total interest around four thousand seven hundred.",
        "descripcion_visual": "Same comparative panel, now with the AFTER column fully active: rate near 7%, payment around 495, and total interest around 4,700 in soft green. A teal arrow of light connects the BEFORE and AFTER columns.",
        "funcion_narrativa": "Show the new possible deal after the band jump: lower rate, slightly lower monthly payment, and much lower total interest.",
        "prompt_imagen": "Isometric 3D split-panel results display (CREDIT_BEFORE_AFTER_RESULTS), now with the AFTER column active. On the right, a rate block near 7%, a monthly payment block around 495, and a total interest block around 4,700 highlighted with a soft green accent. A crystal arrow with teal light connects the BEFORE column on the left to the AFTER column on the right. Dark navy background, photorealistic.",
        "prompt_video": "Smooth Truck Right camera move sliding focus from the BEFORE column to the AFTER column as the right side lights up: the 7% rate, ~495 payment, and ~4,700 interest blocks glow softly in green, while the teal arrow pulses to show the shift.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B08_P04",
        "block_id": "B08_RESULT",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "MONEY_WEALTHBLOCK_GOLD",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "You’ve just kept about two thousand three hundred dollars in interest in your own pocket. That’s after-tax money—money you already worked for that doesn’t need to leave your account. Same car. Same job. Same income. The difference is the version of your report the bank saw when it took the snapshot.",
        "descripcion_visual": "Isometric shot of a solid gold block on the lab table representing savings. An abstract numeric ring around it indicates a difference of about 2,300. Behind, the before/after panel is blurred; in front, a glass shield protects a small stack of cash.",
        "funcion_narrativa": "Close the result block by emphasizing the net interest savings as real, after-tax money staying in the user’s pocket.",
        "prompt_imagen": "Isometric 3D shot (MONEY_WEALTHBLOCK_GOLD) of a solid gold block on a smoked-glass lab table, representing savings. An abstract numeric ring around it indicates a difference of about 2,300. Behind it, the BEFORE/AFTER results panel is softly out of focus. In front of the gold block, a transparent glass shield protects a small stack of cash. Dark institutional background, photorealistic, no readable text.",
        "prompt_video": "Cinematic slow Zoom In toward the gold block and the protected cash stack as the abstract 2,300 difference ring completes a subtle rotation. The blurred before/after panel in the background remains stable, reinforcing that the savings come purely from the changed snapshot.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B09_P01",
        "block_id": "B09_REALITY_CHECK",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_REPORT_PANEL",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom In",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Now, let’s be clear about what this protocol is not. It is not a cure for defaults. If you’ve got a fresh collection on your file, this won’t erase it.",
        "descripcion_visual": "Isometric shot of a credit report panel with one row highlighted in soft red. The highlighted row carries an abstract default/collection mark and an alert icon, while the rest of the panel is muted.",
        "funcion_narrativa": "Make clear that the protocol does not erase serious derogatories like fresh collections or defaults.",
        "prompt_imagen": "Isometric 3D shot of a credit report panel (CREDIT_REPORT_PANEL) in a dark institutional financial lab. Several rows represent credit lines, but one row is highlighted with a soft red alert icon and an abstract default or collection mark. The rest of the panel is muted and desaturated so the red problem area stands out. Deep navy background, photorealistic, no readable text.",
        "prompt_video": "Cinematic slow Zoom In toward the red-highlighted default row while the rest of the panel gently fades further into the background. The camera stays smooth and controlled, emphasizing that this damage remains even with the protocol.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B09_P02",
        "block_id": "B09_REALITY_CHECK",
        "shot_id": "P02",
        "core_flag": false,
        "mv_context": "LAB_TABLE",
        "asset_id": "BUDGET_MODULE_V01",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Left",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "It is not income verification. If you can’t afford the loan, you still shouldn’t take the loan.",
        "descripcion_visual": "Isometric view of a simple budget module on a lab table. Income icons appear on one side, essential expense blocks (rent, food, transport) on the other, and a separate loan payment block being added. A small traffic-light style indicator sits in amber.",
        "funcion_narrativa": "Remind the viewer that this hack does not replace the basic ability to afford the loan.",
        "prompt_imagen": "Isometric 3D view of a budget module (BUDGET_MODULE_V01) on a smoked-glass table: income icons on one side, essential expense blocks on the other, and a separate loan payment block being squeezed in. A small traffic-light indicator hovers nearby in amber, showing that the budget is tight. Dark navy institutional background, photorealistic, no readable text.",
        "prompt_video": "Smooth Truck Left camera move across the budget module, revealing how the loan payment block squeezes into an already tight lineup of essential expenses while the amber indicator stays lit. Motion is calm and documentary.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B09_P03",
        "block_id": "B09_REALITY_CHECK",
        "shot_id": "P03",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": null,
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Handheld",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "And it’s fragile. This is a snapshot hack, not a personality transplant. If you run your balances back up next month, your score will slide back down.",
        "descripcion_visual": "Isometric shot of a tower built from transparent credit card blocks, stacked like a Jenga tower on the lab table. Some upper blocks show utilization bars rising again into higher zones, and the entire tower leans slightly as if unstable.",
        "funcion_narrativa": "Visualize the fragility of the hack: if you build balances back up, the score falls again.",
        "prompt_imagen": "Isometric 3D scene of a tower built from transparent credit card blocks, stacked like a Jenga tower on a lab table. Some of the upper blocks show utilization bars creeping back into higher zones, and the entire tower leans slightly as if unstable. A teal system cable connected to the base vibrates subtly. Dark financial war room background, photorealistic, no text.",
        "prompt_video": "Subtle Handheld-style camera movement circling the wobbling tower of card blocks as utilization indicators rise, conveying instability without chaos. Motion is gentle but less steady, reinforcing how easy it is to knock the system out of tune.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B09_P04",
        "block_id": "B09_REALITY_CHECK",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_WALL",
        "asset_id": "CREDIT_MANUALREVIEW_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "If the person whose card you joined slips up, your file can get dragged down with theirs. And some lenders will manually look at your report and ignore authorized-user lines if they don’t think they reflect your real behavior. So treat this as a precision tool for optimizing your application window, not a permanent fix for a broken budget.",
        "descripcion_visual": "Isometric shot of a credit report panel facing a manual review module on the lab wall. Some rows carry a small authorized-user icon; a focused analysis beam highlights only the lines that match the user’s own behavior, leaving authorized-user lines dimmer.",
        "funcion_narrativa": "Reinforce that some lenders can ignore authorized-user lines and that this is a precision tool, not a permanent cure.",
        "prompt_imagen": "Isometric 3D shot of a credit report panel and a manual review module (CREDIT_MANUALREVIEW_MODULE) in a dark institutional financial lab. Certain rows have a small authorized-user icon, while a focused analysis lens casts a light beam that clearly highlights only the lines matching the user’s own behavior. Authorized-user lines appear slightly dimmed under the beam. A subtle label area hints at manual review without readable text. Deep navy background, photorealistic.",
        "prompt_video": "Slow, controlled Orbit that moves from the credit report panel to the manual review module and back, showing how the analysis beam emphasizes only the user’s own lines while authorized-user rows remain dim. Motion is calm and authoritative, underscoring precision and limits.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B10_P01",
        "block_id": "B10_OUTRO",
        "shot_id": "P01",
        "core_flag": true,
        "mv_context": "LAB_MAIN",
        "asset_id": "CREDIT_REPORT_PANEL",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Orbit",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "If you only remember one thing from this Lab Test, make it this: don’t let the bank see you on your worst day. Curate the snapshot.",
        "descripcion_visual": "Isometric view of the Financial War Room. In the foreground, a clean credit snapshot panel sits on the main table with the futuristic camera lens above it. In the background, abstract silhouettes of a car and a home are connected to the panel by teal cables.",
        "funcion_narrativa": "Reinforce the core idea: don’t let the bank see your worst-day snapshot; that image drives the price.",
        "prompt_imagen": "Isometric 3D wide shot of the dark institutional financial war room. In the foreground, a clean credit snapshot panel (CREDIT_REPORT_PANEL) sits on a smoked-glass table with the CREDIT_SNAPSHOT_CAMERA lens pointing down at it. In the background, abstract silhouettes of a car (ICON_CAR_LOAN style) and a home (ICON_HOME) are connected to the panel by glowing teal cables. Deep navy background, photorealistic, no readable text.",
        "prompt_video": "Slow, controlled Orbit around the central snapshot panel as the teal cables to the car and home pulse softly, emphasizing that this frozen image drives real-world price. Camera motion is calm and authoritative.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B10_P02",
        "block_id": "B10_OUTRO",
        "shot_id": "P02",
        "core_flag": true,
        "mv_context": "LAB_TABLE",
        "asset_id": "CREDIT_EXAMMODE_MODULE",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Truck Right",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Three moves, one protocol: put your cards in Exam Mode — all zero, except one tiny, intentional balance. Borrow history carefully, only from people you deeply trust. And watch the statement dates, not just the due dates, so the camera captures your best version right before you apply.",
        "descripcion_visual": "Isometric shot of three glass modules lined up on a lab table representing the three moves: Exam Mode, Borrowing History, and Snapshot Timing. A continuous teal flow line runs through all three in sequence.",
        "funcion_narrativa": "Summarize the protocol visually in three clear, memorable modules.",
        "prompt_imagen": "Isometric 3D shot of three separate glass modules on a smoked-glass table in the financial war room. Module 1 (CREDIT_EXAMMODE_MODULE style) shows several greyed-out cards with one glowing teal card (Exam Mode). Module 2 (CREDIT_BORROWHISTORY_MODULE style) shows two data avatars connected by a teal cable (Borrowing History). Module 3 (CREDIT_TIMELINE_SNAPSHOT style) shows a camera icon above a clean timeline marker (Snapshot Timing). A continuous teal flow line connects all three modules in sequence. Dark navy background, photorealistic, no readable text.",
        "prompt_video": "Smooth Truck Right camera move sliding across the three modules in order while the teal flow line animates from Exam Mode to Borrowing History to Snapshot Timing, briefly pulsing at each module to mark the steps of the protocol.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B10_P03",
        "block_id": "B10_OUTRO",
        "shot_id": "P03",
        "core_flag": false,
        "mv_context": "LAB_WALL",
        "asset_id": "LAB_WALL_WEST_EXPERIMENTS",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Zoom Out",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "Here at Hintsly Lab we’re building a library of experiments like this — from safer savings tweaks to more aggressive credit maneuvers. If you want to see how these protocols behave in the Lab before you risk them with your own money, hit subscribe and check the links in the description for the Experiment Sheet for Test 001.",
        "descripcion_visual": "Isometric view of a large lab wall converted into an experiment library. Each experiment is a glass module with an abstract test code like 001, 002, 003. Holographic panels above show different financial systems, all wired into a central Hintsly Lab core node.",
        "funcion_narrativa": "Position Hintsly Lab as a growing library of tested protocols you can watch before touching your own money.",
        "prompt_imagen": "Isometric 3D view of a large lab wall filled with glass experiment modules (LAB_WALL_WEST_EXPERIMENTS). Each module is visually labeled with an abstract test code like 001, 002, 003. Holographic panels above them show different financial systems and graphs. All modules are connected by teal cables into a central Hintsly Lab core node. Dark institutional background, photorealistic, no detailed text.",
        "prompt_video": "Cinematic slow Zoom Out starting from one specific experiment module labeled Test 001 and revealing the wider wall of many experiments all wired into the central Hintsly core, giving a sense of a growing library the viewer can explore.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    },
    {
        "video_id": "csj_B10_P04",
        "block_id": "B10_OUTRO",
        "shot_id": "P04",
        "core_flag": true,
        "mv_context": "LAB_MAIN",
        "asset_id": "LAB_WALL_NORTH",
        "asset_mode": "IMAGE_1F_VIDEO",
        "camera_move": "Tilt Up",
        "duracion_seg": 8.0,
        "texto_voz_resumido": "You’ll see the assumptions, example numbers, and a simple way to estimate what a Clean Score Jump could mean in your case. This was Hintsly Lab Test 001 — The Clean Score Jump. Class dismissed.",
        "descripcion_visual": "Wide isometric shot of the entire Financial War Room. Overhead lights turn off in sequence, leaving only the central Hintsly core logo and a few teal accents glowing on the north wall. The Clean Score Jump panel on the main table fades into standby.",
        "funcion_narrativa": "End the episode with a lab-class dismissal feeling, reinforcing Hintsly Lab and Test 001 as part of a larger series.",
        "prompt_imagen": "Wide isometric 3D shot of the entire financial war room (LAB_WALL_NORTH). Overhead lights switch off in sequence, leaving only the central Hintsly Lab core logo glowing in electric teal on the north wall. On the main table, the Clean Score Jump panel dims into standby. Deep navy and black tones, photorealistic, no readable text.",
        "prompt_video": "Slow Tilt Up starting at the main lab table as the experiment panel dims, then rising to frame the glowing Hintsly Lab core logo as the last element left illuminated, giving a clear sense of closure and end of class.",
        "image_path": "",
        "video_path": "",
        "estado": "PENDIENTE",
        "error_message": null
    }
]